# Taps
tap "stripe/stripe-cli"

# Core (not installed by default on all Macs)
brew "git"
brew "curl"
brew "jq"
brew "coreutils"

# CLI essentials
brew "bat"
brew "direnv"
brew "eza"
brew "fd"
brew "fzf"
brew "fzf-tab"
brew "gh"
brew "git-delta"
brew "lazygit"
brew "ripgrep"
brew "shellcheck"
brew "starship"
brew "stow"
brew "tmux"
brew "tree"
brew "zoxide"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"

# Languages & runtimes
brew "go"
brew "neovim"
brew "uv"

# Dev tools
brew "actionlint"
brew "stripe/stripe-cli/stripe"

# Services
brew "ollama"
brew "postgresql@14"

# Infra
brew "awscli"
brew "tailscale"

# Apps — core
cask "arc"
cask "claude"
cask "cursor"
cask "ghostty"
cask "google-chrome"
cask "obsidian"
cask "raycast"

# Apps — work
cask "linear-linear"
cask "notion"
cask "slack"
cask "zoom"

# Apps — media
cask "discord"
cask "obs"
cask "spotify"
cask "vlc"

# Gaming (uncomment as needed)
# cask "battle-net"
# cask "steam"
# cask "godot"
# cask "godot-mono"
