# Core
brew "git"
brew "jq"

# CLI essentials
brew "bat"
brew "direnv"
brew "eza"
brew "fd"
brew "fzf"
brew "fzf-tab"
brew "gh"
brew "git-delta"
brew "lazygit"
brew "ripgrep"
brew "starship"
brew "stow"
brew "tmux"
brew "tree"
brew "zoxide"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"

# Languages & runtimes
brew "go"
brew "neovim"
brew "uv"

# Dev tools
brew "actionlint"

# Apps
cask "claude"
cask "ghostty"
